export interface GreeceCity {
  city: string;
  areas: string[];
}

export interface GreeceRegion {
  region: string;
  cities: GreeceCity[];
}

export const GREECE_LOCATIONS: GreeceRegion[] = [
  {
    region: 'Αττική',
    cities: [
      {
        city: 'Αθήνα',
        areas: [
          'Κέντρο',
          'Σύνταγμα',
          'Ομόνοια',
          'Μοναστηράκι',
          'Πλάκα',
          'Κολωνάκι',
          'Εξάρχεια',
          'Παγκράτι',
          'Μετς',
          'Κουκάκι',
          'Νέος Κόσμος',
          'Αμπελόκηποι',
          'Γκύζη',
          'Κυψέλη',
          'Πατήσια',
          'Άνω Πατήσια',
          'Κάτω Πατήσια',
          'Γαλάτσι',
          'Ζωγράφου',
          'Ιλίσια',
          'Καισαριανή',
          'Βύρωνας',
          'Υμηττός',
          'Δάφνη',
          'Νέα Σμύρνη',
          'Καλλιθέα',
          'Ταύρος',
          'Πετράλωνα',
          'Θησείο',
          'Σεπόλια',
          'Κολωνός',
          'Ακαδημία Πλάτωνος',
          'Βοτανικός',
          'Ρουφ',
          'Γουδή'
        ]
      },
      {
        city: 'Πειραιάς',
        areas: [
          'Κέντρο Πειραιά',
          'Πασαλιμάνι',
          'Καστέλλα',
          'Μικρολίμανο',
          'Καμίνια',
          'Ταμπούρια',
          'Μανιάτικα',
          'Νέο Φάληρο',
          'Πειραϊκή',
          'Χατζηκυριάκειο',
          'Καλλίπολη'
        ]
      },
      {
        city: 'Νίκαια',
        areas: ['Κέντρο', 'Άνω Νίκαια', 'Κάτω Νίκαια']
      },
      {
        city: 'Κορυδαλλός',
        areas: ['Κέντρο', 'Άνω Κορυδαλλός']
      },
      {
        city: 'Περιστέρι',
        areas: ['Κέντρο', 'Μπουρνάζι', 'Ανθούπολη', 'Λόφος Αξιωματικών', 'Νέα Ζωή']
      },
      {
        city: 'Αιγάλεω',
        areas: ['Κέντρο', 'Ιερά Οδός', 'Εσταυρωμένος']
      },
      {
        city: 'Χαϊδάρι',
        areas: ['Κέντρο', 'Δάσος Χαϊδαρίου', 'Αφαία']
      },
      {
        city: 'Ίλιον',
        areas: ['Κέντρο', 'Παλατιανή', 'Ραδιοφωνία']
      },
      {
        city: 'Άγιοι Ανάργυροι',
        areas: ['Κέντρο', 'Ανάκασα']
      },
      {
        city: 'Νέα Ιωνία',
        areas: ['Κέντρο', 'Περισσός', 'Αλσούπολη', 'Καλογρέζα']
      },
      {
        city: 'Ηράκλειο Αττικής',
        areas: ['Κέντρο', 'Παλαιό Ηράκλειο', 'Νέο Ηράκλειο']
      },
      {
        city: 'Μαρούσι',
        areas: ['Κέντρο', 'Σωρός', 'Πολύδροσο', 'Άγιος Θωμάς', 'Παράδεισος']
      },
      {
        city: 'Χαλάνδρι',
        areas: ['Κέντρο', 'Κάτω Χαλάνδρι', 'Πάτημα', 'Πολύδροσο']
      },
      {
        city: 'Αγία Παρασκευή',
        areas: ['Κέντρο', 'Κοντόπευκο', 'Σταυρός']
      },
      {
        city: 'Βριλήσσια',
        areas: ['Κέντρο', 'Άνω Βριλήσσια']
      },
      {
        city: 'Μελίσσια',
        areas: ['Κέντρο']
      },
      {
        city: 'Κηφισιά',
        areas: ['Κέντρο', 'Νέα Κηφισιά', 'Κάτω Κηφισιά', 'Πολιτεία', 'Εκάλη']
      },
      {
        city: 'Γλυφάδα',
        areas: ['Κέντρο', 'Άνω Γλυφάδα', 'Τερψιθέα', 'Αιξωνή']
      },
      {
        city: 'Βούλα',
        areas: ['Κέντρο', 'Πανόραμα', 'Κάτω Βούλα']
      },
      {
        city: 'Βουλιαγμένη',
        areas: ['Κέντρο', 'Καβούρι']
      },
      {
        city: 'Άλιμος',
        areas: ['Κέντρο', 'Καλαμάκι', 'Άνω Καλαμάκι']
      },
      {
        city: 'Παλαιό Φάληρο',
        areas: ['Κέντρο', 'Αμφιθέα', 'Μπάτης']
      },
      {
        city: 'Αργυρούπολη',
        areas: ['Κέντρο', 'Άνω Αργυρούπολη']
      },
      {
        city: 'Ελληνικό',
        areas: ['Κέντρο', 'Σούρμενα']
      },
      {
        city: 'Αχαρνές',
        areas: ['Κέντρο', 'Μενίδι', 'Θρακομακεδόνες']
      },
      {
        city: 'Λαύριο',
        areas: ['Κέντρο']
      },
      {
        city: 'Κορωπί',
        areas: ['Κέντρο']
      },
      {
        city: 'Μαρκόπουλο',
        areas: ['Κέντρο', 'Πόρτο Ράφτη']
      },
      {
        city: 'Παλλήνη',
        areas: ['Κέντρο', 'Γέρακας', 'Ανθούσα']
      },
      {
        city: 'Ραφήνα',
        areas: ['Κέντρο']
      },
      {
        city: 'Μέγαρα',
        areas: ['Κέντρο', 'Νέα Πέραμος']
      },
      {
        city: 'Ελευσίνα',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Θεσσαλονίκη',
    cities: [
      {
        city: 'Θεσσαλονίκη',
        areas: [
          'Κέντρο',
          'Άνω Πόλη',
          'Τούμπα',
          'Κάτω Τούμπα',
          'Χαριλάου',
          'Ντεπώ',
          'Καλαμαριά',
          'Νέα Κρήνη',
          'Βότση',
          'Πυλαία',
          'Πανόραμα',
          'Σταυρούπολη',
          'Εύοσμος',
          'Κορδελιό',
          'Αμπελόκηποι',
          'Μενεμένη',
          'Συκιές',
          'Νεάπολη',
          'Πολίχνη',
          'Ωραιόκαστρο',
          'Θέρμη'
        ]
      }
    ]
  },
  {
    region: 'Αχαΐα',
    cities: [
      {
        city: 'Πάτρα',
        areas: ['Κέντρο', 'Αγυιά', 'Ρίο', 'Ζαρουχλέικα', 'Ταραμπούρα', 'Ψηλαλώνια', 'Εγλυκάδα', 'Μποζαΐτικα']
      },
      {
        city: 'Αίγιο',
        areas: ['Κέντρο']
      },
      {
        city: 'Κάτω Αχαΐα',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Ηράκλειο',
    cities: [
      {
        city: 'Ηράκλειο',
        areas: ['Κέντρο', 'Μασταμπάς', 'Θέρισσος', 'Αλικαρνασσός', 'Γιόφυρος', 'Αμμουδάρα', 'Φορτέτσα']
      },
      {
        city: 'Μοίρες',
        areas: ['Κέντρο']
      },
      {
        city: 'Χερσόνησος',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Λάρισα',
    cities: [
      {
        city: 'Λάρισα',
        areas: ['Κέντρο', 'Νεάπολη', 'Αβέρωφ', 'Φιλιππούπολη', 'Αλκαζάρ']
      },
      {
        city: 'Τύρναβος',
        areas: ['Κέντρο']
      },
      {
        city: 'Φάρσαλα',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Μαγνησία',
    cities: [
      {
        city: 'Βόλος',
        areas: ['Κέντρο', 'Νέα Ιωνία', 'Ανάληψη', 'Άγιος Κωνσταντίνος', 'Νέες Παγασές']
      },
      {
        city: 'Αλμυρός',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Ιωάννινα',
    cities: [
      {
        city: 'Ιωάννινα',
        areas: ['Κέντρο', 'Ανατολή', 'Κατσικάς', 'Σεισμόπληκτα', 'Πέραμα']
      }
    ]
  },
  {
    region: 'Έβρος',
    cities: [
      {
        city: 'Αλεξανδρούπολη',
        areas: ['Κέντρο', 'Μάκρη', 'Νέα Χιλή']
      },
      {
        city: 'Ορεστιάδα',
        areas: ['Κέντρο']
      },
      {
        city: 'Διδυμότειχο',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Καβάλα',
    cities: [
      {
        city: 'Καβάλα',
        areas: ['Κέντρο', 'Καλαμίτσα', 'Περιγιάλι', 'Βύρωνας']
      },
      {
        city: 'Χρυσούπολη',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Σέρρες',
    cities: [
      {
        city: 'Σέρρες',
        areas: ['Κέντρο', 'Σιγής', 'Κοιλάδα Αγίων Αναργύρων']
      }
    ]
  },
  {
    region: 'Κοζάνη',
    cities: [
      {
        city: 'Κοζάνη',
        areas: ['Κέντρο', 'Ηπειρώτικα', 'Σκρκά']
      },
      {
        city: 'Πτολεμαΐδα',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Τρίκαλα',
    cities: [
      {
        city: 'Τρίκαλα',
        areas: ['Κέντρο', 'Βαρούσι', 'Καρυές']
      },
      {
        city: 'Καλαμπάκα',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Καρδίτσα',
    cities: [
      {
        city: 'Καρδίτσα',
        areas: ['Κέντρο', 'Καμινάδες']
      }
    ]
  },
  {
    region: 'Φθιώτιδα',
    cities: [
      {
        city: 'Λαμία',
        areas: ['Κέντρο', 'Νέα Άμπλιανη', 'Παγκράτι', 'Γαλανέικα']
      }
    ]
  },
  {
    region: 'Εύβοια',
    cities: [
      {
        city: 'Χαλκίδα',
        areas: ['Κέντρο', 'Κάνηθος', 'Νεάπολη', 'Λιανή Άμμος']
      },
      {
        city: 'Αλιβέρι',
        areas: ['Κέντρο']
      },
      {
        city: 'Ιστιαία',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Βοιωτία',
    cities: [
      {
        city: 'Λιβαδειά',
        areas: ['Κέντρο']
      },
      {
        city: 'Θήβα',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Κορινθία',
    cities: [
      {
        city: 'Κόρινθος',
        areas: ['Κέντρο', 'Συνοικισμός', 'Καλάμια']
      },
      {
        city: 'Λουτράκι',
        areas: ['Κέντρο']
      },
      {
        city: 'Κιάτο',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Αργολίδα',
    cities: [
      {
        city: 'Ναύπλιο',
        areas: ['Κέντρο', 'Παλιά Πόλη']
      },
      {
        city: 'Άργος',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Αρκαδία',
    cities: [
      {
        city: 'Τρίπολη',
        areas: ['Κέντρο', 'Σέχι']
      }
    ]
  },
  {
    region: 'Μεσσηνία',
    cities: [
      {
        city: 'Καλαμάτα',
        areas: ['Κέντρο', 'Παραλία', 'Γιαννιτσάνικα', 'Φραγκοπήγαδο']
      }
    ]
  },
  {
    region: 'Λακωνία',
    cities: [
      {
        city: 'Σπάρτη',
        areas: ['Κέντρο']
      },
      {
        city: 'Γύθειο',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Χανιά',
    cities: [
      {
        city: 'Χανιά',
        areas: ['Κέντρο', 'Παλιά Πόλη', 'Χαλέπα', 'Νέα Χώρα', 'Κουμπές']
      }
    ]
  },
  {
    region: 'Ρέθυμνο',
    cities: [
      {
        city: 'Ρέθυμνο',
        areas: ['Κέντρο', 'Παλιά Πόλη', 'Κουμπές', 'Μασταμπάς']
      }
    ]
  },
  {
    region: 'Λασίθι',
    cities: [
      {
        city: 'Άγιος Νικόλαος',
        areas: ['Κέντρο']
      },
      {
        city: 'Ιεράπετρα',
        areas: ['Κέντρο']
      },
      {
        city: 'Σητεία',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Δωδεκάνησα',
    cities: [
      {
        city: 'Ρόδος',
        areas: ['Κέντρο', 'Παλιά Πόλη', 'Ιαλυσός', 'Κρεμαστή', 'Φαληράκι']
      },
      {
        city: 'Κως',
        areas: ['Κέντρο']
      },
      {
        city: 'Κάλυμνος',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Κυκλάδες',
    cities: [
      {
        city: 'Ερμούπολη',
        areas: ['Κέντρο', 'Άνω Σύρος']
      },
      {
        city: 'Νάξος',
        areas: ['Χώρα Νάξου']
      },
      {
        city: 'Πάρος',
        areas: ['Παροικιά', 'Νάουσα']
      },
      {
        city: 'Μύκονος',
        areas: ['Χώρα Μυκόνου', 'Ορνός', 'Άνω Μερά']
      },
      {
        city: 'Σαντορίνη',
        areas: ['Φηρά', 'Οία', 'Μεσσαριά', 'Καμάρι']
      }
    ]
  },
  {
    region: 'Λέσβος',
    cities: [
      {
        city: 'Μυτιλήνη',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Χίος',
    cities: [
      {
        city: 'Χίος',
        areas: ['Κέντρο', 'Βροντάδος']
      }
    ]
  },
  {
    region: 'Σάμος',
    cities: [
      {
        city: 'Σάμος',
        areas: ['Βαθύ', 'Πυθαγόρειο', 'Καρλόβασι']
      }
    ]
  },
  {
    region: 'Κέρκυρα',
    cities: [
      {
        city: 'Κέρκυρα',
        areas: ['Παλιά Πόλη', 'Κέντρο', 'Κανόνι', 'Γαρίτσα']
      }
    ]
  },
  {
    region: 'Ζάκυνθος',
    cities: [
      {
        city: 'Ζάκυνθος',
        areas: ['Κέντρο', 'Λαγανάς', 'Τσιλιβί']
      }
    ]
  },
  {
    region: 'Κεφαλονιά',
    cities: [
      {
        city: 'Αργοστόλι',
        areas: ['Κέντρο']
      },
      {
        city: 'Ληξούρι',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Αιτωλοακαρνανία',
    cities: [
      {
        city: 'Μεσολόγγι',
        areas: ['Κέντρο']
      },
      {
        city: 'Αγρίνιο',
        areas: ['Κέντρο', 'Άγιος Κωνσταντίνος']
      },
      {
        city: 'Ναύπακτος',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Ηλεία',
    cities: [
      {
        city: 'Πύργος',
        areas: ['Κέντρο']
      },
      {
        city: 'Αμαλιάδα',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Πρέβεζα',
    cities: [
      {
        city: 'Πρέβεζα',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Άρτα',
    cities: [
      {
        city: 'Άρτα',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Θεσπρωτία',
    cities: [
      {
        city: 'Ηγουμενίτσα',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Φλώρινα',
    cities: [
      {
        city: 'Φλώρινα',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Καστοριά',
    cities: [
      {
        city: 'Καστοριά',
        areas: ['Κέντρο', 'Ντολτσό']
      }
    ]
  },
  {
    region: 'Γρεβενά',
    cities: [
      {
        city: 'Γρεβενά',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Πέλλα',
    cities: [
      {
        city: 'Έδεσσα',
        areas: ['Κέντρο']
      },
      {
        city: 'Γιαννιτσά',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Ημαθία',
    cities: [
      {
        city: 'Βέροια',
        areas: ['Κέντρο']
      },
      {
        city: 'Νάουσα',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Πιερία',
    cities: [
      {
        city: 'Κατερίνη',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Κιλκίς',
    cities: [
      {
        city: 'Κιλκίς',
        areas: ['Κέντρο']
      },
      {
        city: 'Πολύκαστρο',
        areas: ['Κέντρο']
      },
      {
        city: 'Γουμένισσα',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Χαλκιδική',
    cities: [
      {
        city: 'Πολύγυρος',
        areas: ['Κέντρο']
      },
      {
        city: 'Νέα Μουδανιά',
        areas: ['Κέντρο']
      },
      {
        city: 'Νικήτη',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Ξάνθη',
    cities: [
      {
        city: 'Ξάνθη',
        areas: ['Κέντρο', 'Παλιά Πόλη']
      }
    ]
  },
  {
    region: 'Ροδόπη',
    cities: [
      {
        city: 'Κομοτηνή',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Δράμα',
    cities: [
      {
        city: 'Δράμα',
        areas: ['Κέντρο']
      }
    ]
  },
  {
    region: 'Ροδόπη',
    cities: [
      {
        city: 'Κομοτηνή',
        areas: ['Κέντρο']
      }
    ]
  }
];
